
"""  "1.กำหนดให้ month = [\"Jan\",\"May\",\"Jul\",\"Aug\",\"Oct\",\"Dec\"]\n",
  "1.1ให้เขียนคำสั่งโปรแกรมเรียกใช้เมธอด แทรกเดือนที่ขาดหายไป\n",
    "1.2ให้เขียนคำสั่งโปรแกรมเรียกใช้เมธอด ลบชื่อเดือนตำแหน่งที่ 2,5,9 ออกจากลิสต์\n",
    "1.3ให้เขียนคำสั่งโปรแกรมเรียกใช้เมธอด แสดงชื่อเดือนที่เหลืออยู่ในลิสต์" """
month=["Jan","May","Jul","Aug","Oct","Dec"]
print("ข้อมูลเดือน",month)
month.insert(1,"Feb")
month.insert(2,"Mar")
month.insert(3,"Apr")
month.insert(5,"Jun")
month.insert(8,"Sep")
month.insert(10,"Nov")
print("แทรกเดือนที่ขาดหายไป =",month)
month.remove("Feb")
month.remove("May")
month.remove("Sep")
print("ลบชื่อเดือนตำแหน่งที่ 2,5,9 ออกจากลิสต์ =",month)
print("แสดงชื่อเดือนที่เหลืออยู่ในลิสต์ =",month)
   
"""
    "2.กำหนดให้ days = [\"Sun\",\"Mon\",\"Tuel\",\"Wed\",\"Thu\",\"Fri\",\"Sat\"]\n",
    "2.1ให้เขียนคำสั่งโปรแกรมเรียกใช้เมธอด เรียงชื่อวันจากท้ายสุด\n",
    "2.2ให้เขียนคำสั่งโปรแกรมเรียกใช้เมธอด เรียงลำดับชื่อวันตามตัวอักษร\n",
    "2.3ให้เขียนคำสั่งโปรแกรมแสดงชื่อวันในตำแหน่งที่ 3,5 และ 7"
 """
"""      "เรียงชื่อวันจากท้ายสุด = ['Sat', 'Fri', 'Thu', 'Wed', 'Tue', 'Mon', 'Sun']\n",
      "เรียงลำดับชื่อวันตามตัวอักษร = ['Fri', 'Mon', 'Sat', 'Sun', 'Thu', 'Tue', 'Wed']\n",
      "แสดงชื่อวัน ในตำแหน่งที่ 3,5 และ 7 = ['Sat', 'Thu', 'Wed'] """
  
days = ["Sun","Mon","Tue","Wed","Thu","Fri","Sat"]
print("days :",days)
days.reverse()
print("เรียงชื่อวันจากท้ายสุด =",days)
days.sort()
print("เรียงลำดับชื่อวันตามตัวอักษร =",days)
print("แสดงชื่อวันในตำแหน่งที่ 3,5 และ 7 =",days[2:7:2])
 
